src/DataProcessors/ОповещениеОПремиальныхТоварах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОповещениеОПремиальныхТоварах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивВыбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаВыбора</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйПодбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивПомеченных</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодстрокаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПремиальныеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевойТовар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ОповещениеОПремиальныхТоварах/Forms/Форма/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

Процедура ЗаполнитьДерево()
	Для Каждого Т Из ПремиальныеТовары Цикл
		МС = Т.Акция.ПремиальныеТовары.НайтиСтроки(Новый Структура("Товар", Т.Товар));
		Для каждого СМС Из МС Цикл
		
			Т.Станция = ?(Т.Станция="","",", ") + СМС.Станция;	
		
		КонецЦикла; 
		
		Т.Станция = "На станции " + Т.Станция + ":";
		Если Т.Акция.ТипАкции = Справочники.ТипыАкций.НаборТоваров Тогда
			
			Для каждого СМС Из Т.Акция.ЦелевыеТовары Цикл
				
				Т.ЦелевойТовар = ?(Т.ЦелевойТовар="","",", ") + СМС.Товар;	
				
			КонецЦикла; 
			
			Т.ЦелевойТовар  = "За ваш заказ " + Т.ЦелевойТовар;
		Иначе
			Т.ЦелевойТовар = "За ваш заказ свыше " + Т.Акция.ПороговаяСумма + " " + Символ(8381);
		КонецЕсли; 
		


		
	КонецЦикла;
	
	ПремиальныеТовары.Свернуть("Станция,Товар,ЦелевойТовар","Количество");
	
	
	тЦелевые = ПремиальныеТовары.Выгрузить(,"ЦелевойТовар");
	тЦелевые.Свернуть("ЦелевойТовар");

	тСтанции = ПремиальныеТовары.Выгрузить(,"Станция,ЦелевойТовар");
	тСтанции.Свернуть("Станция,ЦелевойТовар");
	
	Дерево.Строки.Очистить();
	Для каждого ЦелевойТовар Из тЦелевые Цикл
	
		СтрокаЦелевой = Дерево.Строки.Добавить();
		СтрокаЦелевой.Имя = ЦелевойТовар.ЦелевойТовар;
		
		мсСтанции = тСтанции.НайтиСтроки(Новый Структура("ЦелевойТовар",ЦелевойТовар.ЦелевойТовар));
		Для каждого стСтанция Из мсСтанции Цикл
			
			СтрокаСтанция = СтрокаЦелевой.Строки.Добавить();
			СтрокаСтанция.Имя = "  " + стСтанция.Станция;
			
			МС = ПремиальныеТовары.НайтиСтроки(Новый Структура("Станция,ЦелевойТовар",стСтанция.Станция,стСтанция.ЦелевойТовар));
			Для каждого СтТовар Из МС Цикл
				
				СтрокаТовар = СтрокаСтанция.Строки.Добавить();
				СтрокаТовар.Имя = "  " + СтТовар.Товар;
				СтрокаТовар.Количество = ?(СтТовар.Количество>=1, "" + СтТовар.Количество + "шт","");
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ЗаполнитьДерево();
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
			
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
	РаботаСокнами.CloseScreenKey();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОК(Элемент)
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);
